Repository: neishm/fstd2nc
Catalog: fstd2nc/locale/*.po
Languages: fr_ca

source: Warning: %s
fr_ca: Avertissement: %s

source: Error: %s
fr_ca: Erreur: %s

source: No grid mapping found
fr_ca: Aucun mappage de grille trouvé

source: Multiple grid mappings found: %s
fr_ca: Plusieurs mappages de grille trouvés: %s

source: Unhandled grid mapping: %s
fr_ca: Mappage de grille non géré: %s

source: Display %s metadata in a structured format.
fr_ca: Afficher les métadonnées %s dans un format structuré.

source: The %s to query.
fr_ca: Le %s à interroger.

source: Display the values for the specified variable.
fr_ca: Afficher les valeurs pour la variable spécifiée.

source: problem opening one or more input files.
fr_ca: problème d'ouverture d'un ou plusieurs fichiers d'entrée.

source: Converts %s to netCDF format.
fr_ca: Convertit %s au format netCDF.

source: The %s to convert.
fr_ca: Le %s à convertir.

source: The name of the netCDF file to create.
fr_ca: Le nom du fichier netCDF à créer.

source: How much information to print to stdout during the conversion. Default is %(default)s.
fr_ca: Combien d'informations à imprimer sur stdout pendant de la conversion. Le défaut est %(default)s

source: Which variant of netCDF to write. Default is %(default)s.
fr_ca: Quelle variante de netCDF écrire. Le défaut est %(default)s.

source: Turn on compression for the netCDF file. Only works for NETCDF4 and NETCDF4_CLASSIC formats.
fr_ca: Activer la compression pour le fichier netCDF. Ne Fonctionne que pour les formats NETCDF4 et NETCDF4_CLASSIC.

source: Compression level for the netCDF file. Only used if --zlib is set. Default: %(default)s.
fr_ca: Niveau de compression du fichier netCDF. Ne utilisé que si --zlib est specifié. Le défaut est %(default)s.

source: Overwrite the output file if it already exists.
fr_ca: Remplacer le fichier de sortie s'il existe déjà.

source: Don't put the command-line invocation in the netCDF metadata.
fr_ca: Ne placer pas l'invocation de la ligne de commande dans les métadonnées netCDF

source: Don't display any information except for critical error messages. Implies --no-progress.
fr_ca: N'afficher pas quelque information moins les messages d'erreur critiques. Implique --no-progress

source: Warning: '%s' already exists! Overwrite? (y/n):
fr_ca: Avertissement: '%s' existe déjà! Remplacer? (o/n):

source: Sorry, invalid response.
fr_ca: Désolé, réponse invalide.

source: Refusing to overwrite existing file '%s'.
fr_ca: Refus de remplacer le fichier existant '%s'.

source: Aborted by user.
fr_ca: Annulé par l'utilisateur.

source: NAME,NAME,...
fr_ca: NOM,NOM,...

source: Exclude some axes, attributes, or derived variables from the output. For instance, excluding 'leadtime,reftime' can help for netCDF tools that don't recognize leadtime and reftime as valid coordinates. Note that axes will only be excluded if they have a length of 1.
fr_ca: Exclure quelque axes, attributs, ou variables dérivées de la sortie. Par exemple, l'exclusion de 'leadtime,reftime' peut aider les outils netCDF qui ne reconnaissent pas leadtime et reftime comme des coordonnées valides. Notez que les axes ne seront exclus que s'ils ont une longueur de 1.

source: Subset %s records using the given criteria. For example, to convert only 24-hour forecasts you could use --filter ip2==24
fr_ca: Sous-ensemble d'enregistrements %s en utilisant les critères donnés. Par exemple, pour convertir seulement les prévisions sur 24 heures, vous pouvez utiliser --filter ip2==24

source: unable to apply the filter: %s
fr_ca: impossible d'appliquer le filtre: %s

source: unable to parse the filter: %s
fr_ca: impossible d'analyser le filtre: %s

source: Define additional surface aggregate fields.
fr_ca: Définir des champs d'agrégats de surface additionnel.

source: Define custom depths for soil fields (%s). Defaults are %%(default)s.
fr_ca: Définir des profondeurs personnalisée pour les champs de sol (%s). Les défauts sont %%(default)s.

source: Unable to parse soil-depths parameter.
fr_ca: Impossible d'analyser le paramètre 'soil-depths'.

source: More than the expected number of soil depths were found. No depth values will be encoded.
fr_ca: Plus que le nombre prévu de profondeurs de sol ont été trouvées. Aucune valeur de profondeur ne sera encodée.

source: For data on supergrids, split the subgrids along a "subgrid" axis. The default is to leave the subgrids stacked together as they are in the RPN file.
fr_ca: Pour les données sur les 'supergrids', divisez les grilles sur une axe "subgrid". Le défaut est garder les sous-grilles ensemble comme elles sont dans le fichier RPN.

source: Include LA and LO records, even if they appear to be redundant.
fr_ca: Inclure les enregstrement LA et LO, même s'ils semblent redondants.

source: For rotated grids, do NOT adjust rlon coordinate to keep the range in -180..180. Allow the rlon value to be whatever librmn says it should be.
fr_ca: Pour les grilles tournées, n'ajustez PAS la coordonnée rlon pour conserver la plage entre -180..180. Utilise la plage que vient de librmn.

source: Include grid cell boundaries in the output.
fr_ca: Inclure les limites des cellules de grille dans la sortie.

source: Unable to get lat/lon coordinates for '%s'
fr_ca: Impossible d'obtenir les coordonnées lat/lon pour '%s'

source: Wrong shape of lat/lon for '%s'
fr_ca: Mauvaise forme de lat/lon pour '%s'

source: Unusual grid axes for '%s' - ignoring.
fr_ca: Axes de grille inhabituels pour '%s' - ignorés.

source: Standard parallel must be 60 deg to encode polar stereographic projections. Found %s instead.
fr_ca: Le parallèle standard doit être de 60 degrés pour coder les projections stéréographiques polaires. Trouve %s à la place.

source: Sterographic projection missing attribute "straight_vertical_longitude_from_pole"
fr_ca: L'attribut "straight_vertical_longitude_from_pole" est manquant pour la projection stéréographique.

source: latitude_of_projection_origin must be 90 or -90. Found %s
fr_ca: latitude_of_projection_origin doit être de 90 ou -90. Trouve %s

source: Comma-separated list of variables that use momentum levels.
fr_ca: Liste de variables séparées par des virgules qui utilisent des niveaux thermodynamiques.

source: Comma-separated list of variables that use thermodynamic levels.
fr_ca: Liste de variables séparées par des virgules qui utilisent des niveaux momentum.

source: Assume the bottom level of the profile data is missing.
fr_ca: Supposer que le niveau final des données de profil est manquant.

source: Wrong number of momentum levels found in the data.
fr_ca: Mauvais nombre de niveaux momentum trouvés dans les données.

source: Wrong number of thermodynamic levels found in the data.
fr_ca: Mauvais nombre de niveaux thermodynamique trouvés dans les données.

source: Unable to find the vertical coordinates for %s.
fr_ca: Impossible de trouver les coordonnées verticales pour %s.

source: Can't use datev for timeseries data with multiple dates of origin. Try re-running with the --dateo option.
fr_ca: Impossible d'utiliser datev pour les données de séries temporelles avec plusieurs dates d'origine. Assayez relancer avec l'option --dateo.

source: The fill value to use for masked (missing) data. Gets stored as '_FillValue' attribute in the metadata. Default is '%(default)s'.
fr_ca: La valeur de remplissage à utiliser pour les données masquées (manquantes). Enregistré en tant qu'attribut '_FillValue' dans les métadonnées. Le défaut est '%(default)s'.

source: Can't set fill value '%g' for %s.
fr_ca: Impossible de définir la valeur de replissage '%g' pour %s.

source: Detected masked data. Changing typvar from '%s' to '%s' and writing separate mask record.
fr_ca: Données masquées détectés. Changer typvar de '%s' à '%s' est écrire un enregistrement de masque séparé.

source: Encoding masks with datyp+64 not supported yet.
fr_ca: Encoder des masques avec datyp+64 n'est pas encore supporté.

source: Comma-separated list of variables to convert. By default, all variables are converted.
fr_ca: Liste de variables séparées par des virgules à convertir. Par défaut, toutes les variables sont converties.

source: Will look for variables:
fr_ca: Cherchera des variables:

source: Unable to find variable(s):
fr_ca: Impossible de trouver la ou les variables:

source: Nothing to convert.
fr_ca: Rein à convertir.

source: Use metadata from the specified file. You can repeat this option multiple times to build metadata from different sources.
fr_ca: Utiliser les métadonnées du fichier spécifié.

source: Apply the specified name changes to the variables.
fr_ca: Appliquer les changes de nom spécifiés aux variables.

source: Set the "Conventions" attribute for the netCDF file. Default is "%(default)s". Note that this has no effect on the structure of the file.
fr_ca: Définir l'attribut "Conventions" pour le fichier netCDF. Le défaut est "%(default)s". Notez que cela n'a aucun effet sur la structure du fichier.

source: Omit the "Conventions" attribute from the netCDF file entirely. This can help for netCDF tools that have trouble recognizing the CF conventions encoded in the file.
fr_ca: Omettre entièrement l'attribut "Conventions" du fichier netCDF.

source: Unable to parse the rename arguments.
fr_ca: Impossible d'analyser les arguments de renommage.

source: '%s' does not exist.
fr_ca: '%s' n'existe pas.

source: The units for the output time axis. Default is %(default)s.
fr_ca: Les unités de l'axe du temps de sortie. Le défaut est %(default)s.

source: YYYY-MM-DD
fr_ca: AAAA-MM-JJ

source: The reference date for the output time axis. The default is the starting date in the %s.
fr_ca: La date de référence pour l'axe de temps de sortie. Le défaut est la date de début dans le %s.

source: Unable to parse the reference date '%s'. Expected format is '%s'
fr_ca: Impossible d'analyser la date de référence '%s'. Format attendu est '%s'

source: Multiple %s axes. Appending integer suffixes to their names.
fr_ca: Plusiers axes %s. Ajout de suffixes entiers à leurs noms.

source: Multiple definitions of %s. Adding unique suffixes %s.
fr_ca: Plusiers définitions de %s. Ajout de suffixes unique %s.

source: Renaming '%s' to '_%s'.
fr_ca: Renommer '%s' en '_%s'.

source: Renaming '%s' to '%s'.
fr_ca: Renommer '%s' en '%s'.

source: netCDF3 does not support unsigned ints. Converting %s to signed int.
fr_ca: netCDF3 ne prend pas en charge les entiers non signés. Convertis %s en entier signé.

source: No relevant FST records were found.
fr_ca: Aucun enregistrement FST pertinent n'a été trouvé.

source: Saving netCDF file
fr_ca: Ecriture du fichier netCDF.

source: Internal problem with the script - unable to get data for '%s'
fr_ca: Problème interne avec le script - impossible d'obtenir les données pour '%s'

source: Collect different etikets for the same variable together into an "ensemble" axis.
fr_ca: Rassembler différentes etikets pour la même variable ensemble dans une axe "ensemble".

source: Raw binary records detected. The values may not be properly decoded if you're opening on a different platform.
fr_ca: Enregistrements binaires bruts détectés.

source: RPN standard file
fr_ca: fichier standard RPN

source: an RPN standard file
fr_ca: un fichier standard RPN

source: RPN standard file(s)
fr_ca: fichier(s) standard

source: Tells the converter to ignore the typvar when deciding if two records are part of the same field. Default is to split the variable on different typvars.
fr_ca: Indique au convertisseur d'ignorer la typvar lorsqu'il décide si deux enregistrements font partie du même champ. Le défaut est de diviser la variable sur différents typvars.

source: Tells the converter to ignore the etiket when deciding if two records are part of the same field. Default is to split the variable on different etikets.
fr_ca: Indique au convertisseur d'ignorer l'etiket lorsqu'il décide si deux enregistrements font partie du même champ. Le défaut est de diviser la variable sur différents etikets.

source: Require the IP1/IP2/IP3 parameters of the vertical coordinate to match the IG1/IG2/IG3 paramters of the field in order to be used. The default behaviour is to use the vertical record anyway if it's the only one in the file.
fr_ca: Exiger que les paramètres IP1/IP2/IP3 de la coordonnée verticale correspondent aux paramètres IG1/IG2/IG3 du champ afin d'être utilisés. La comportement par défaut est d'utiliser l'enregistrement vertical de toute façon s'il est le seul dans le fichier.

source: Treat diagnostic (near-surface) data as model level '1.0'. This is the default behaviour.
fr_ca: Traiter les données diagnostic (près de la surface) comme niveau de modèle '1.0'. Ceci est la comportement par défaut.

source: Put the diagnostic (near-surface) data in a separate variable, away from the 3D model output. Suffices will be added to distinguish the different types of levels (i.e. _diag_level and _model_levels for diagnostic height and hybrid levels respectively).
fr_ca: Placer les données diagnostic (près de la surface) dans une variable séparée, loin de la sortie du modèle 3D.

source: Ignore data on diagnostic (near-surface) height.
fr_ca: Ignorer les données sur la hauteur diagnostique (près de la surface).

source: Only use the diagnostic (near-surface) height, ignoring other atmospheric levels.
fr_ca: Utiliser seulement la hauteur diagnostique (près de la surface), en ignorant les autres niveaux atmosphériques.

source: Only convert data that's on 'thermodynamic' vertical levels.
fr_ca: Convertir seulement les données qui se trouvent sur des niveaux verticaux 'thermodynamiques'.

source: Only convert data that's on 'momentum' vertical levels.
fr_ca: Convertir seulement les données qui se trouvent sur des niveaux verticaux 'momentum'.

source: Only convert data that's on 'vertical velocity' levels.
fr_ca: Convertir seulement les données qui se trouvent sur des niveaux 'vitesse verticale'.

source: Unable to parse thermodynamic levels from the vertical coordinate
fr_ca: Impossible d'analyser les niveaux thermodynamiques à partir de la coordonnée verticale

source: Unable to parse momentum levels from the vertical coordinate
fr_ca: Impossible d'analyser les niveaux momentum à partir de la coordonnée verticale

source: Unable to parse vertical velocity levels from the vertical coordinate
fr_ca: Impossible d'analyser les niveaux vitesse verticale à partir de la coordonnée verticale

source: Problem decoding !! record.
fr_ca: Problème de décodage de l'enregistrement !!.

source: Unable to get A/B coefficients for %s.
fr_ca: Impossible d'obtenir les coefficients A/B pour %s.

source: Mixture of model / height levels found. This will cause multiple definitions of variables in the output. If this is undesired, you could try using --ignore-diag-level or --diag-as-model-level.
fr_ca: Mélange de niveaux de modèle / hauteur trouvés. Cela entraînera plusieurs définitions de variables dans la sortie. Si cela est indésirable, vous pouvez essayer d'utiliser --ignore-diag-level ou --diag-as-model-level.

source: Having trouble treating %s diagnostic level as model level - splitting into a separate field.
fr_ca: Problème de traitement du niveau de diagnostic de %s comme niveau de modèle - le divise dans un champ séparé.

source: Cannot read from %s - file may be missing or damaged.
fr_ca: Impossible de lire à partir de %s - le fichier est peut-être manquant ou endommagé.

source: Unable to fuse some variables.
fr_ca: Impossible de fusionner la ou les variables:

source: Dates out of bounds for pandas routines. Using alternative (slower) routines.
fr_ca: Dates hors limites pour les routines des pandas. Utiliser des routines alternatives (plus lentes).

source: 'batch' size (%d) does not divide evenly into number of files (%s)
fr_ca: Taille 'batch' (%d) ne se divise pas uniformément en nombre de fichiers (%s)

source: Indexing the files
fr_ca: Indexer les fichiers

source: show program's version number and exit
fr_ca: afficher le numéro de version du programme et quitter

source: Display a progress bar during the conversion, if the "progress" module is installed.
fr_ca: Affiche une barre de progression pendant de la conversion, si le module "progress" est installé.

source: Disable the progress bar.
fr_ca: Désactiver la barre de progression.

source: Disables multithreading/multiprocessing. Useful for resource-limited machines.
fr_ca: Désactiver le multithreading/multitraitement. Utile pour les machines à ressources limitées.

source: Don't include internal record attributes and other internal information in the output metadata.
fr_ca: Ne pas inclure les attributs d'enregistrement internes et d'autres informations internes dans les métadonnées de sortie.

source: This is the default behaviour.
fr_ca: Ceci est la comportement par défaut.

source: Include all internal record attributes in the output metadata.
fr_ca: Inclure tous les attributs d'enregistrement internes dans les métadonnées de sortie.

source: Specify a minimal set of internal record attributes to include in the output file.
fr_ca: Spécifier un ensemble minimal d'attributs d'enregistrement internes à inclure dans le fichier de sortie.

source: Unexpected arguments: %s
fr_ca: Arguments inattendus: %s

source: Inspecting input files
fr_ca: Inspection des fichiers d'entrée

source: '%s' is not %s.
fr_ca: '%s' n'est pas %s.

source: Directory '%s' does not contain any %s.
fr_ca: Le répertoire '%s' ne contient aucun %s.

source: No %s match '%s'.
fr_ca: Aucun %s ne correspond à '%s'.

source: Problem with input file '%s'
fr_ca: Probleme avec fichier d'entrée '%s'

source: no input files found!
fr_ca: aucun fichier d'entrée sont trouvé!

source: Found %d %s
fr_ca: Trouve %s %s

source: Missing some records for %s.
fr_ca: Quelque enregistrements sont manquants pour %s.

source: Unknown axis '%s'. Encoding not complete.
fr_ca: L'axe '%s' inconnue. Encodage incomplet.

source: Unable to encode %s.
fr_ca: Impossible d'encoder '%s'.

source: Nothing to encode!
fr_ca: Rein à encoder!

source: Unhandled inner axis %s.
fr_ca: Axe intérieur non géré: %s

source: Use metadata from the specified variable dictionary (XML format).
fr_ca: Utiliser les métadonnées du dictionnaire de variables spécifié (format XML).

source: Similar to above, but use the standard CMC-RPN operational dictionary.
fr_ca: Similaire à ce qui précéde, mais utilise le dictionnaire opérationnel standard CMC-RPN.

source: Unable to find $CMCCONST/opdict/ops.variable_dictionary.xml
fr_ca: Impossible de trouver $CMCCONST/opdict/ops.variable_dictionary.

source: Unable to find $AFSISIO/datafiles/constants/opdict/ops.variable_dictionary.xml
fr_ca: Impossible de trouver $AFSISIO/datafiles/constants/opdict/ops.variable_dictionary.

source: Neither $CMCCONST nor $AFSISIO defined. Can't find operational dictionary.
fr_ca: Ni $CMCCONST ni $AFSISIO définis. Impossible de trouver le dictionnaire opérationnel.

source: Unable to find '%s'
fr_ca: Impossible de trouver '%s'

source: Invalid dictionary file '%s'
fr_ca: Le fichier de dictionnare '%s' est invalide.

source: Use the date of validity for the "time" axis. This is the default.
fr_ca: Utiliser la date de validité pour l'axe "time". Ceci est le défaut.

source: Use the date of original analysis for the time axis, and put the forecast times into a separate "forecast" axis.
fr_ca: Utiliser la date d'analyse d'origine pour l'axe temporel, et placer les heurs de prévision dans un axe "forecast" séparé.

source: Specify which fields to treat as accumulated quantities (using IP3 as accumulation period).
fr_ca: Spécifier les champs à traiter comme des quantités cumulées (en utilisant IP3 comme période de cumul).

source: Ignoring IP3 value %d for %s, of unknown purpose. If this is an accumulated variable, you could specify it in the --accum-vars option.
fr_ca: Ignorer la valeur IP3 %d pour %s, dont l'objectif est inconnu. S'il s'agit d'une variable accumulée, vous pouvez la spécifier dans l'option --accum-vars.

source: Multiple IP3 values of unknown purpose found for %s. If this is an accumulated variable, you could specify it in the --accum-vars option.
fr_ca: Plusieurs valeurs IP3 à but inconnu trouvées pour %s. S'il s'agit d'une variable accumulée, vous pouvez la spécifier dans l'option --accum-vars.

source: Adds a compatibility layer to the netCDF output file, so it can also function as a valid FSTD file. EXPERIMENTAL.
fr_ca: Ajoute une couche de compatibilité au fichier de sortie netCDF, qu'il puisse également fonctionner comme un fichier FSTD valide. EXPÉRIMENTAL.

source: Problem writing compatible record for %s:%s. Writing separate netCDF / FSTD versions instead.
fr_ca: Probleme d'ecriture d'enregistrement compatible pour %s:%s. Écrire des versions distinct de netCDF / FSTD à la place.

source: Unknown grid '%s'
fr_ca: Grille inconnue '%s'

source: Select first subgrid from a supergrid.
fr_ca: Sélectionner la première sous-grille d'une super grille.

source: Select second subgrid from a supergrid.
fr_ca: Sélectionner la deuxième sous-grille d'une super grille.

source: Crop grids to the smaller (inner core) domain for LAM outputs.
fr_ca: Couper les grilles au domaine plus petit (noyau interne) pours les sorties LAM.

source: .__call__() not defined
fr_ca: .__call__() non défini

source: unknown parser %(parser_name)r (choices: %(choices)s)
fr_ca: Analyseur inconnue %(parser_name)r (choix: %(choices)s)

source: argument "-" with mode %r
fr_ca: argument "-" avec le mode %r

source: can't open '%s': %s
fr_ca: impossible d'ouvrir '%s': %s

source: cannot merge actions - two groups are named %r
fr_ca: impossible de fusionner les actions - deux groupes sont nommés %r

source: 'required' is an invalid argument for positionals
fr_ca: 'required' est un argument invalide pour les positionnels

source: invalid option string %(option)r: must start with a character %(prefix_chars)r
fr_ca: chaîne d'option invalide %(option)r: doit commencer par un caractère %(prefix_chars)r.

source: dest= is required for options like %r
fr_ca: dest= est requis pour les options comme %r

source: invalid conflict_resolution value: %r
fr_ca: valeur conflict_resolution invalide: %r

source: conflicting option string: %s
fr_ca: chaîne d'option en conflit: %s

source: mutually exclusive arguments must be optional
fr_ca: les arguments mutuellement exclusifs doivent être optionnel.

source: positional arguments
fr_ca: arguments positionnels

source: optional arguments
fr_ca: arguments optionnel

source: show this help message and exit
fr_ca: afficher ce message d'aide et quitter

source: cannot have multiple subparser arguments
fr_ca: impossible d'avoir plusiers arguments de sous-analyseur

source: unrecognized arguments: %s
fr_ca: arguments inconnus: %s

source: not allowed with argument %s
fr_ca: non autorisé avec l'argument %s

source: ignored explicit argument %r
fr_ca: ignoré l'argument explicite %r

source: the following arguments are required: %s
fr_ca: les arguments suivants sont requis: %s

source: one of the arguments %s is required
fr_ca: un des arguments %s est requis

source: expected one argument
fr_ca: attendu un argument

source: expected at most one argument
fr_ca: attendu au plus un argument

source: expected at least one argument
fr_ca: attendu au moins un argument

source: expected %s argument
fr_ca: attendu %s argument

source: ambiguous option: %(option)s could match %(matches)s
fr_ca: option ambiguë: %(option)s peut correspondre à %(matches)s

source: unexpected option string: %s
fr_ca: chaîne d'option inattendu: %s

source: %r is not callable
fr_ca: %r n'est pas appelable

source: invalid %(type)s value: %(value)r
fr_ca: valeur de %(type)s invalide: %(value)r

source: invalid choice: %(value)r (choose from %(choices)s)
fr_ca: choix invalide: %(value)r (choisissez entre %(choices)s)

source: %(prog)s: error: %(message)s
fr_ca: %(prog)s: erreur: %(message)s
